Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary
Represents a single model summary in a list as returned by the Structural Data Product.
Nullability of the DTO properties to be checked and finalized later.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.ModelId
Gets or sets the unique identifier for the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.VersionId
Gets or sets the unique identifier for the "current" version of the model.
TODO: This may be changed to the "latest" version in the future. TBD.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.SchemaVersion
Gets or sets the schema version of the model, which defines the structure and format of the model data.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.Name
Gets or sets the name of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.Type
Gets or sets the type of the model, ie. structural.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.OwnerId
Gets or sets the unique identifier of the owner of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.Tags
Gets or sets the models tags to categorize the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.Metadata
Gets or sets optional custom key-value metadata for the model.Can be used for additional information about the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.CreatedAt
Gets or sets the creation timestamp of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.CreatedBy
Gets or sets the principal person who created the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.UpdatedAt
Gets or sets the last updated timestamp of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.UpdatedBy
Gets or sets the principal person who last updated the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary.LatestVersion
Gets or sets the latest version of the model will be returned by the Structural Data Product API.